hans-jorg/efm32gg-stk3700-gcc-cmsis/34-NAND-Flash/nand-flash.c
/**
 * @file  nand-flash.c
 * @brief Interface routine for the NAND256-A Flash device in the
 *        EFM32GG-STK3700 board
 *
 * @note  The Flash device depends on the board version
 *          * BRD2200A: NAND256W3A
 *          * BRD2200C: Windbond W29N01HV.
 *
 * @note  The most important characteristics are shown in the table below.
 *
 *  | Parameter              |  Value NAND256W3A  | Value W29N01HV   | Unit  |
 *  |------------------------|--------------------|------------------|-------|
 *  | Memory size            |       256          |        1024      | Mbit  |
 *  | Memory size (Mbytes)   |        32          |         128      | MBytes|
 *  | Memory size (bytes)    |  33554432          |                  | bytes |
 *  | Address bits           |        25          |                  | bits  |
 *  | Bus width              |         8          |           8      | bits  |
 *  | Block size             |        32          |          64      | pages |
 *  | # Blocks               |      2048          |        1024      | blocks|
 *  | #Program/Erase cycles  |   100.000          |     100.000      | cycles|
 *  | #Data Retention        |        10          |          10      | years |
 *  | Page size              |    512+16          |     2048+64      | bytes |
 *  | Block size             | 16384+512          |     128K+4K      | bytes |
 *  | Spare size             |        16          |          64      | bytes |
 *  | Block erase time       |         2          |        2-10      | ms    |
 *  | Random access          |        10          |                  | us    |
 *  | Sequential access      |        50          |                  | ns    |
 *  | Page program time      |       200          |     250-700      | us    |
 *  | Minimum # Valid blocks |      2008          |        1004       | blocks|
 *
 * @note
 *      The Flash device is powered thru a TS4A3166 or a SIP32431 switch,
 *      controlled by NAND_PWR_EN.
 *
 * @note
 *      It can be used as the device interface for the FatFS middleware
 *      It does not have Garbage Collection nor Wear-Leveling mechanims
 *
 * @version 1.0.0
 * Date:    28 April 2026
 *
 *
 *
 * @note  Pìnout
 *
 * | MCU Pin | PCB Signal  | Flash Signal | MCU Signal  | Description          |
 * |---------|-------------|--------------|-------------|----------------------|
 * | PD13    | NAND_WP#    |    WP#       | GPIO_PD13   | Write Protect        |
 * | PD14    | NAND_CE#    |    E#        | GPIO_PD14   | Chip Enable          |
 * | PD15    | NAND_R/B#   |    R/B#      | GPIO_PD15   | Ready/Busy indicator |
 * | PC1     | NAND_ALE    |    AL        | EBI_A24     | Address Latch Enable |
 * | PC2     | NAND_CLE    |    CL        | EBI_A25     | Command Latch Enable |
 * | PF8     | NAND_WE#    |    W#        | EBI_WEn     | Write Enable         |
 * | PF9     | NAND_RE#    |    R#        | EBI_REn     | Read Enable          |
 * | PE15    | NAND_IO7    |    I/O7      | EBI_AD7     | I/O bit #7           |
 * | PE14    | NAND_IO6    |    I/O6      | EBI_AD6     | I/O bit #6           |
 * | PE13    | NAND_IO5    |    I/O5      | EBI_AD5     | I/O bit #5           |
 * | PE12    | NAND_IO4    |    I/O4      | EBI_AD4     | I/O bit #4           |
 * | PE11    | NAND_IO3    |    I/O3      | EBI_AD3     | I/O bit #3           |
 * | PE10    | NAND_IO2    |    I/O2      | EBI_AD2     | I/O bit #2           |
 * | PE9     | NAND_IO1    |    I/O1      | EBI_AD1     | I/O bit #1           |
 * | PE8     | NAND_IO0    |    I/O0      | EBI_AD0     | I/O bit #0           |
 * | PB15    | NAND_PWR_EN |      -       | GPIO_PB15   | Power enable/switch  |
 *
 *
 * @note From RM 14.3.13 "For CEDC NAND Flash the shared EBI_REn and EBI_WEn
 * pins can be used instead of the dedicated EBI_NANDREn  and EBI_NANDWEn pins
 *
 * @note https://catonmat.net/low-level-bit-hacks
 *       https://graphics.stanford.edu/~seander/bithacks.html
 *
 */


#include <stdint.h>
#include "gpio3.h"
#include "nand-flash.h"
#include "em_device.h"

#ifndef BIT
#define BIT(N)  (1U<<(N))
#endif


/**
 *  @brief  NAND256 address parameters
 *
 *  @note
 *
 *  | Address bits |  Description     |
 *  |--------------|------------------|
 *  |     A0-A7    | Column Address   |
 *  |     A9-A26   | Page Address     |
 *  |     A9-A13   | Address in Block |
 *  |     A14-A26  | Block Address    |
 *  |     A8       | Address Half Page|
 *
 *  @note For x8 devices A8 is set using the command for pointing to
 *        A or B halfpage
 *  @note For x16 devices it is a Don’t Care
 *
 *
 *  AAA AAAA AAAA AAAA AAAA AAAA AAAA
 *  222 2222 1111 1111 1198 7654 3210
 *  654 3210 9876 5432 10.. .... ....
 *  ---------------------------------
 *  333 2222 2222 1111 1111 0000 0000   Byte #
 *  ---------------------------------   Address mask
 *  000 XXXX XXXX XXXX XXXY XXXX XXXX   16 MB (=128 Mb)
 *  00X XXXX XXXX XXXX XXXY XXXX XXXX   32 MB (=256 Mb)
 *  0XX XXXX XXXX XXXX XXXY XXXX XXXX   64 MB (=512 Mb) page address
 *  XXX XXXX XXXX XXXX XXXY XXXX XXXX   128 MB (=1024 Mb) page address
 *  ---------------------------------   Mask
 *  000 0000 0000 0000 000X XXXX XXXX   Column address mask
 *  *** XXXX XXXX XXXX XXX0 0000 0000   Row address
 *  *** XXXX XXXX XX00 0000 0000 0000   Block address
 *  000 0000 0000 00XX XXX0 0000 0000   Page displacement inside the block
 *
 *  Addressing cycles
 *  #1     A7-0
 *  #2     A16-9   (No A8!!!!!!!!)
 *  #3     A24-17
 *  #4     A26-25  (remaining as 0)
 *
 *  @note  A8 is defined by the command READ A (A8=0)
 *         and READ B (A8=1)
 *
 *  @note  They should be defined as function of the parameters in nand-flash.h
 */
///@{
#define HALFPAGEMASK                (0xFF)
#define PAGEMASK                    (0x1FF)
#define BLOCKMASK                   (0x3FFF)
#define COPYREGIONMASK              (0x1000000)
#define ADDRESSMASK                 NAND_MAXADDRESS
#define GETCOLUMNADDRESS(A)         ((A)&0xPAGEMASK)

#define IsPageAddress(A)             (((A)&PAGEMASK)==0)
#define IsBlockAddress(A)           (((A)&BLOCKMASK)==0)
///@}

/**
 * @brief Pin Configuration for GPIO
 *
 * @note
 *        WP:  Output. Write protect
 *        CE:  Output. Chip enable
 *        RB:  Ready=1/Busy=0
 *        PWR: Enable power to the nand device
 */
///@{
#define WP_GPIO                             GPIOD
#define WP_PINMASK                          BIT(13)
#define WP_PINMODE                          GPIO_MODE_PUSHPULL

#define CE_GPIO                             GPIOD
#define CE_PINMASK                          BIT(14)
#define CE_PINMODE                          GPIO_MODE_PUSHPULL

