hans-jorg/efm32gg-stk3700-gcc-cmsis/34-NAND-Flash/nand-flash.c
/*
 *  @brief  Nano delay
 */
void nano_delay(uint32_t n) {
    while(n--) {
        __NOP();
    }
}

/*********************** Command routine **************************************/

/**
 *  @brief  Send Command
 */
static int32_t
SendCommand(int32_t cmd, uint32_t address) {
    for(int32_t i=0;i<CommandList[cmd].n;i++) {
        uint8_t command =  CommandList[cmd].v[i];
        if( command == FULLADDRESS ) {
            NAND_ADDRESS = address&0xFF;
            address >>= 9;   // No A8
            NAND_ADDRESS = address&0xFF;
            address >>= 8;
            NAND_ADDRESS = address&0xFF;
            // Only for 512 MB and 1 GB devices
            // address >>= 8;
            // NAND_ADDRESS = address&0xFF;
        } else if ( command == SHORTADDRESS ) {
            address >>= 9;
            NAND_ADDRESS = address&0xFF;
            address >>= 8;
            NAND_ADDRESS = address&0xFF;
            // Only for 512 MB and 1 GB devices
            // address >>= 8;
            // NAND_ADDRESS = address&0xFF;
        } else {
            NAND_COMMAND = command;
        }

    }

    int32_t rc = NAND_WaitUntilReadyPin();
    rc = NAND_WaitUntilReadyPin();

    return rc; // Nonzero if OK
}

/*********************** Pin control routines *********************************/

///@{
/**
 * @brief  Auxiliary routines (not exported) to control Power Enable, Chip
 *         Enable and Write Protection
 *
 * @note   They are controlled explicitly using the GPIO
 *
 * @note   They hid the signal polarity
 */

static inline void EnablePWR(void) {
    // Set to High (positive logic)
    GPIO_SetPins(PWR_GPIO, PWR_PINMASK);
    NAND_WaitUntilReadyPin();
}

static inline void DisablePWR(void) {
    // Set to  Low (positive logic)
    GPIO_ClearPins(PWR_GPIO, PWR_PINMASK);
}

static inline void EnableCE(void) {
    // Set to Low (Active Low)
    GPIO_ClearPins(CE_GPIO, CE_PINMASK);
}

static inline void DisableCE(void) {
    // Set to High (Active Low)
    GPIO_SetPins(CE_GPIO, CE_PINMASK);
}

static inline void EnableWP(void) {
    // Set to Low due to the negative logic
    GPIO_ClearPins(WP_GPIO, WP_PINMASK);
}

static inline void DisableWP(void) {
    // Set to High due to the negative logic
    GPIO_SetPins(WP_GPIO, WP_PINMASK);
}

// For debug mainly
void  NAND_EnableWriteProtect(void) {
    // Enable Write Protect using the WP pin
    EnableWP();
}

// For debug mainly
void  NAND_DisableWriteProtect(void) {
    // Disable Write Protect using the WP pin
    DisableWP();
}
///@}

/*********************** Initialization routines ******************************/

/**
 *  @brief  Enable EBI clock
 */
static inline void EnableEBIClock(void) {
    CMU->HFPERCLKDIV  |= CMU_HFPERCLKDIV_HFPERCLKEN;// Enable HFPERCLK
    CMU->HFCORECLKEN0 |= CMU_HFCORECLKEN0_EBI;      // Enable EBI Clock
}

/**
 * @brief  Configure GPIO pins used for the NAND interface
 *
 * @note   Only the pins directly controlled thru GPIO are configured here.
 *         The pins directly controlled by EBI are configured elsewhere
 *
 */
static inline void ConfigGPIOPins(void) {

    // Write Protect, Chip Enable and Power Enable output pins
    GPIO_ConfigPins(WP_GPIO, WP_PINMASK, WP_PINMODE);
    GPIO_ConfigPins(CE_GPIO,  CE_PINMASK,  CE_PINMODE);
    GPIO_ConfigPins(PWR_GPIO, PWR_PINMASK, PWR_PINMODE);
    // Read/Busy input
    GPIO_ConfigPins(RB_GPIO, RB_PINMASK, RB_PINMODE);

    // The default values for output pins
    DisableCE();
    EnableWP();
    EnablePWR();
}

/**
 *  @brief  Configure pins directly controlled by EBI
 *
 *  @note   Pins are configured as Push-Pull before enabling EBI.
 *          This is done in the code example from SiLabs
 */
static inline void ConfigEBIPins(void) {

    // Configure pins before commit them to EBI
    GPIO_ConfigPins(AD_GPIO,AD_PINMASK,GPIO_MODE_PUSHPULL);
    GPIO_ConfigPins(ALE_GPIO,ALE_PINMASK,GPIO_MODE_PUSHPULL);
    GPIO_ConfigPins(CLE_GPIO,CLE_PINMASK,GPIO_MODE_PUSHPULL);
    GPIO_ConfigPins(WE_GPIO,WE_PINMASK,GPIO_MODE_PUSHPULL);
    GPIO_ConfigPins(RE_GPIO,RE_PINMASK,GPIO_MODE_PUSHPULL);

    // Initial values for data bus, write and read pins
    GPIO_ClearPins(AD_GPIO,AD_PINMASK);
    GPIO_SetPins(WE_GPIO,WE_PINMASK);
    GPIO_SetPins(RE_GPIO,RE_PINMASK);
    GPIO_ClearPins(CLE_GPIO,CE_PINMASK);
    GPIO_ClearPins(ALE_GPIO,ALE_PINMASK);

}

/**
 *  @brief  Configure the EBI
 *
 *  @note   Pins are configured before enabling the clock for EBI.
 *
 *  @note Initialization procedure for the STK3700 board as the example
 *        in SDK.
 *
 *  Configure pins including initial values
 *  Mode D8A8
 *  Active Low: WE, RE (ARDY, ALE, CS, BL are not used. Why configure them?)
 *  Disable BL(?)
 *  Enable NOIDLE
 *  Disable ARDY
 *  Disable ARDY timeout
 *  BANK0
 *  No Chip Select
 *  ADDR Setup and Strobe Cycles = 0
 *  Disable Half Cycle ALE
 *  Read Setup, Strobe, Hold = 0,2,1
 *  Disable Page Mode
 *  Disable Prefetch
 *  Disable Half Cycle REn
 *  Write Setup, Strobe, Hold = 0,2,1
 *  Enable Write Buffer
 *  Disable Half Cycle WEn
 *  A24
 *  A25
 *  Use Location 1
 *  Enable EBI
 *
 */

static inline void ConfigEBI(void) {

    // Enable clock for the EBI module (just in case)
    EnableEBIClock();

    /* Do not enable independent timing.
     * It is only needed when more than one bank is used
     * When not set the values for Bank 0 is used for the other Banks.
     */
    //EBI->CTRL |= EBI_CTRL_ITS;

    // Configure polarity
    uint32_t polarity = EBI->POLARITY;
    polarity &= ~(EBI_POLARITY_WEPOL
                 |EBI_POLARITY_REPOL);
    // Why set polarity of pins not used?
    polarity &= ~(EBI_POLARITY_ALEPOL
                 |EBI_POLARITY_ARDYPOL
                 |EBI_POLARITY_CSPOL
                 |EBI_POLARITY_ARDYPOL);
    EBI->POLARITY = polarity;

    // Configure control register.
    // As now it can disturb configuration for other regions
    uint32_t ctrl = _EBI_CTRL_RESETVALUE;
    ctrl |=  EBI_CTRL_MODE_D8A8
            |EBI_CTRL_NOIDLE
            |EBI_CTRL_ARDYTODIS
            |EBI_CTRL_BANK0EN;     // Bank 0
    EBI->CTRL = ctrl;

    // Configure timing for address, read and write signals
    uint32_t addrtiming = _EBI_ADDRTIMING_RESETVALUE;
    addrtiming |=       (ADDR_HOLDTIME<<_EBI_ADDRTIMING_ADDRHOLD_SHIFT)
                       |(ADDR_SETUPTIME<<_EBI_ADDRTIMING_ADDRSETUP_MASK);
    EBI->ADDRTIMING = addrtiming;

    uint32_t rdtiming = _EBI_RDTIMING_RESETVALUE;
    rdtiming |=         (RD_HOLDTIME<<_EBI_RDTIMING_RDHOLD_SHIFT)
                      |(RD_SETUPTIME<<_EBI_RDTIMING_RDSETUP_SHIFT)
                      |(RD_STROBETIME<<_EBI_RDTIMING_RDSTRB_SHIFT);
    EBI->RDTIMING = rdtiming;

    uint32_t wrtiming = _EBI_WRTIMING_RESETVALUE;
    wrtiming =         (WR_HOLDTIME<<_EBI_WRTIMING_WRHOLD_SHIFT)
                      |(WR_SETUPTIME<<_EBI_WRTIMING_WRSETUP_SHIFT)
                      |(WR_STROBETIME<<_EBI_WRTIMING_WRSTRB_SHIFT);
    EBI->WRTIMING = wrtiming;

    // Configure pins use directly by EBI
    uint32_t route = EBI->ROUTE;
    route =  _EBI_ROUTE_RESETVALUE
                 |(EBI_ROUTE_LOCATION_LOC1  // Must be LOC1!!!
                  |EBI_ROUTE_APEN_A26
                  |EBI_ROUTE_ALB_A24
                  |EBI_ROUTE_EBIPEN        // Use WEn and REn
                  );
    EBI->ROUTE = route;

    // Start EBI NAND controller
    EBI->NANDCTRL = (EBI->NANDCTRL
                        &~(_EBI_NANDCTRL_BANKSEL_MASK|EBI_NANDCTRL_EN))
                         |(EBI_NANDCTRL_BANKSEL_BANK0|EBI_NANDCTRL_EN);
}

/**
 * @brief  Initialize NAND device including EBI
 *
 * @return 0 if OK, negative in case of error
 */

int32_t NAND_Init(void) {

    ConfigGPIOPins();
    ConfigEBIPins();

    EnableEBIClock();
    ConfigEBI();

    EnablePWR();
    DisableCE();
    EnableWP();

    int32_t rc = NAND_Status();
    return rc;
}

