hans-jorg/efm32gg-stk3700-gcc-cmsis/34-NAND-Flash/nand-flash.c
/*********************** Status routines **************************************/

/**
 *  @brief  Return status from device using command status
 */
uint32_t NAND_Status(void) {
uint8_t status;

    EnableCE();
    SendCommand(CMD_READSTATUS,0);
    status = NAND_DATA;
    DisableCE();

    return status&NAND_STATUS_ALL;
}

/**
 *  @brief  Wait until Ready/Busy bit in Status Register indicates Ready
 *
 *  @note   Bit R/B# is 1 when device is ready and 0 when busy
 *
 *  @returns 0 when error!
 */
int32_t  NAND_WaitUntilReadyStatus(void) {

    nano_delay(NANO_DELAY);
    uint32_t timeout = NAND_TIMEOUT;
    do {
        NAND_COMMAND = CommandList[CMD_READSTATUS].v[0];
    } while ( --timeout && (NAND_DATA&NAND_STATUS_READY) );
    return NAND_DATA&NAND_STATUS_READY;
}

/**
 *  @brief  Check if Ready using Status Register
 *
 *  @note   Pin R/B# is 1 when device is ready and 0 when busy
 *
 *  @returns 0 when Busy
 */
int32_t  NAND_CheckReadyStatus(void) {

    nano_delay(NANO_DELAY);
    NAND_COMMAND = CommandList[CMD_READSTATUS].v[0];
    return NAND_DATA&NAND_STATUS_READY;
}

///@{
/**
 * @brief  Ready/Busy functions
 *
 * @note
 */

int32_t  NAND_Ready(void) {

    return (GPIO_ReadPins(RB_GPIO)&RB_PINMASK)!=0;
}

int32_t  NAND_Busy(void) {

    return !NAND_Ready();
}

/**
 *  @brief  Wait until Ready/Busy Pin indicates Ready
 *
 *  @note   Pin R/B# is 1 when device is ready and 0 when busy
 *
 *  @returns 0 when error!
 */
int32_t  NAND_WaitUntilReadyPin(void) {

    nano_delay(NANO_DELAY);
    uint32_t timeout = NAND_TIMEOUT;
    while ( --timeout && ( (GPIO_ReadPins(RB_GPIO)&RB_PINMASK)==0) )
        {}
    return (GPIO_ReadPins(RB_GPIO)&RB_PINMASK);
}

/**
 *  @brief  Check if Ready using R/B# pin
 *
 *  @note   Pin R/B# is 1 when device is ready and 0 when busy
 *
 *  @returns 0 when Busy
 */
int32_t  NAND_CheckReadyPin(void) {

    nano_delay(NANO_DELAY);
    return (GPIO_ReadPins(RB_GPIO)&RB_PINMASK);
}
///@}

/*********************** Copy routines ****************************************/

/**
 *  @brief  Copy data from Flash device into memory
 *
 *  @note   Preparation to use DMA
 */
static void CopyFromFlash(uint8_t *data, uint16_t n) {

    for(uint16_t i=0;i<n;i++) {
        data[i] = NAND_DATA;
    }
}

/**
 *  @brief  Copy data from memory to Flash device
 *
 *  @note   Preparation to use DMA
 */
static void CopyToFlash(uint8_t *data, uint16_t n) {

    for(uint16_t i=0;i<n;i++) {
        NAND_DATA = data[i];
    }
}

/*********************** Read Routines ****************************************/

/**
 *  @brief  Return signature of device
 */

int32_t  NAND_ReadSignature(uint8_t *data) {
int32_t rc;

    EnableCE();
    SendCommand(CMD_READSIGNATURE,0);
    rc = NAND_WaitUntilReadyPin();

    CopyFromFlash(data,2);

    DisableCE();
    rc = NAND_Status();

    return rc;
}

/**
  * @brief   NAND_ReadSpare
  *
  * @note    Read a 16 byte from NAND device
  */
int32_t NAND_ReadSpare(uint32_t addr, uint8_t *data) {
int32_t rc;

    if( !IsPageAddress(addr)) {
        return -1;
    }

    EnableCE();
    SendCommand(CMD_READC,addr);

    rc = NAND_WaitUntilReadyPin();

    if( rc != 0 ) {
        CopyFromFlash(data,NAND_SPARESIZE);
    }

    DisableCE();
    rc = NAND_Status();

    return rc;
}

/**
  * @brief   NAND_ReadPage
  *
  * @note    Read a page (512 bytes) from NAND device starting at a given
  *          page aligned address
  */
int32_t NAND_ReadPage(uint32_t addr, uint8_t *data) {
int32_t rc;

    if( !IsPageAddress(addr)) {
        return -1;
    }

    EnableCE();
    SendCommand(CMD_READA,addr);
    rc = NAND_WaitUntilReadyPin();
    if( rc != 0 ) {
        CopyFromFlash(data,NAND_PAGESIZE);
    }

    DisableCE();

    rc = NAND_Status();

    return rc;
}

/**
  * @brief   NAND_ReadFullPage
  *
  * @note    Read a page (528 bytes) from NAND device starting at a given
  *          page address
  */
int32_t NAND_ReadFullPage(uint32_t addr, uint8_t *data) {
int32_t rc;

    if( !IsPageAddress(addr)) {
        return -1;
    }

    EnableCE();
    SendCommand(CMD_READA,addr);
    rc = NAND_WaitUntilReadyPin();

    if( rc != 0 ) {
        CopyFromFlash(data,NAND_FULLPAGESIZE);
    }

    DisableCE();

    rc = NAND_Status();

    return rc;
}

/*********************** Write Routines ***************************************/

/**
  * @brief   NAND_WriteSpare
  *
  * @note    Write a 16 bytes onto NAND device
  */
int32_t NAND_WriteSpare(uint32_t addr, uint8_t *data) {
int32_t rc;

    if( !IsPageAddress(addr)) {
        return -1;
    }

    EnableCE();
    DisableWP();
    SendCommand(CMD_PROGRAMA,addr);
    rc = NAND_WaitUntilReadyPin();

    CopyToFlash(data, NAND_SPARESIZE);

    SendCommand(CMD_CONFIRM,addr);

    EnableWP();
    DisableCE();

    rc = NAND_Status();

    return rc;
}

/**
  * @brief   NAND_WritePage
  *
  * @note    Write a page (512 bytes) into NAND device starting at given page
  *          address
  */
int32_t NAND_WritePage(uint32_t addr, uint8_t *data) {
int32_t rc;

    if( !IsPageAddress(addr)) {
        return -1;
    }
    EnableCE();
    DisableWP();

    SendCommand(CMD_PROGRAMA,addr);
    rc = NAND_WaitUntilReadyPin();

    CopyToFlash(data, NAND_PAGESIZE);

    SendCommand(CMD_CONFIRM,addr);

    EnableWP();
    DisableCE();

    rc = NAND_Status();

    return rc;
}

/**
  * @brief   NAND_WriteFullPage
  *
  * @note    Write a full page (528 bytes) into NAND device starting at given
  *          address. The address must be aligned to a page address.
  *
  * @note    A confirm command is needed after a half page
  */
int32_t NAND_WriteFullPage(uint32_t addr, uint8_t *data) {
int32_t rc;

    if( !IsPageAddress(addr)) {
        return -1;
    }

    EnableCE();
    DisableWP();

    SendCommand(CMD_PROGRAMA,addr);
    rc = NAND_WaitUntilReadyPin();

    CopyToFlash(data, NAND_FULLPAGESIZE);

    SendCommand(CMD_CONFIRM,addr);

    EnableWP();
    DisableCE();

    rc = NAND_Status();

    return rc;
}

/*********************** Erase Routines ***************************************/

/**
  * @brief   NAND_BlockErase
  *
  * @note    Erase a full block of 32 pages
  */
int32_t NAND_EraseBlock(uint32_t addr) {
    int32_t rc;

