hans-jorg/efm32gg-stk3700-gcc-cmsis/34-NAND-Flash/nand-flash.c
    if( !IsBlockAddress(addr)) {
        return -1;
    }

    EnableCE();
    DisableWP();

    SendCommand(CMD_ERASEBLOCK,addr);
    rc = NAND_WaitUntilReadyPin();

    EnableWP();
    DisableCE();

    rc = NAND_Status();

    return rc;
}

/*********************** Copy Back Routine ************************************/
/**
  * @brief   NAND_CopyBack
  *
  * @note    Copy the page at *srcaddr* to the page addressed by *dstaddr*
  */
int32_t  NAND_CopyBack(uint32_t srcaddr, uint32_t dstaddr) {
int32_t rc;

    if( ! (IsPageAddress(srcaddr)&&IsPageAddress(dstaddr)) ) {
        return -1;
    }

    // They must have the same value for
    if( ((srcaddr^dstaddr)&NAND_COPYREGIONMASK) != 0 ) {
        return -2;
    }

    EnableCE();
    DisableWP();

    SendCommand(CMD_COPYBACK1 ,srcaddr);
    rc = NAND_WaitUntilReadyPin();

    SendCommand(CMD_COPYBACK2 ,dstaddr);
    rc = NAND_WaitUntilReadyPin();

    EnableWP();
    DisableCE();

    rc = NAND_Status();

    return rc;
}

/*********************** ECC Routines *****************************************/

#ifdef USE_ECC_ROUTINES
/**
 *  @brief  Get ECC Error Information
 *
 *  @param  w: ECC info
 *
 *  @returns the index of the bit in error
 *
 *  @note   The input word consists of 16 pairs of complementary bit.
 *
 *  P32768  P32768'  P16384  P16384'  ... P4  P4'  P2  P2'  P1  P1'
 *
 *  @note
 *      When the pair is not complementary, it indicates that an error *        *      multiples errors occurred.
 *
 *  @note
 *         |  Data size  |    ECC bits    |
 *         |-------------|----------------|

 *         |     64      |      18        |
 *         |    128      |      20        |
 *         |    256      |      22        |
 *         |    512      |      24        |
 *         |   1024      |      26        |
 *         |   2048      |      28        |
 *         |   4096      |      30        |
 *         |   8192      |      32        |
 *
 * @note
 *
 *
 *
 *
 * @note To correct use the index. The 3 lowest order bit gives the bit index
 *       (0 to 7). The 19 high order bit give the byte index.
 *       Data[index>>3] ^= (1<<(index&0x7));
 *
 */
#define ECCMASK 0x00FFFFFFU

#define ISPOWER2(W)     (((W)&(W-1))==0)


typedef enum {
    NAND_NOERROR,
    NAND_ECCERROR,
    NAND_ONEERROR,
    NAND_MULTIPLEERROR
} NAND_ErrorType;


NAND_ErrorType getECCerror(uint32_t w, uint32_t *pindex) {
const uint32_t pmask = 0xAAAAAAAAU&ECCMASK;
const uint32_t ptickmask = pmask>>1;
uint32_t wp;
uint32_t index;
uint32_t m;

    // Mask out irrelevant bits. For 512 bytes, only 24 bits are needed
    w &= ECCMASK;

    if( w == 0 )
        return NAND_NOERROR;

    // If only one bit is set, error in the ECC
    if( ISPOWER2(w) )
        return NAND_ECCERROR;

    // Only Pn. All Pntick are zeroed
    wp=w&pmask;
    // find wether or not the pairs are complementar
    if(  ((wp>>1)  ^ (w&ptickmask)) != ptickmask )
        return NAND_MULTIPLEERROR;

/* In wp,
  31 30 29 28 27 26 25 24 23 22 21 20 19 18 17 16 15 14 13 12 11 10  9  8  7  6  5  4  3  2  1  0
   0  0  0  0  0  0  0  0  P  0  P  0  P  0  P  0  P  0  P  0  P  0  P  0  P  0  P  0  P  0  P  0
                           2     1     5     2     1     6     3     1     8     4     2     1
                           0     0     1     5     2     4     2     6
                           4     2     2     6     8
                           8     4
   That is, every event bit is 0
   */

    m = 1;
    index = 0;
    while( wp ) {
        if( (wp&2)!=0 )
            index |= m;
        m <<= 1;
        wp >>= 2;
    }
    *pindex = index;

    return NAND_ONEERROR;
}
#endif
